#include<iostream>
using namespace std;

/**********************************************************************************************************************
 * 注释
 *	作用：
 *		在代码中加一些说明和解释，方便自己或其他程序员程序员阅读代码
 *	两种格式:
 *	 	- 单行注释
 * 		- 多行注释
 * 	提示：
 * 		编译器在编译代码时，会忽略注释的内容
 *********************************************************************************************************************/

int main()
{
	// 单行注释

    /*
     * 多
     * 行
     * 注
     * 释
     */


	system("pause");
	return 0;
}