#include<iostream>
using namespace std;

/**********************************************************************************************************************
 * 变量
 * 	作用：
 * 		给一段指定的内存空间起名，方便操作这段内存
 * 	语法：
 * 		数据类型 变量名 = 初始值;
 * 	注意：
 * 		C++在创建变量时，必须给变量一个初始值，否则会报错
 *********************************************************************************************************************/

int main()
{
	// 方式一：先声明后赋值
    int a;
    a = 10;
    cout << "a = " << a << endl;

    // 方式二：声明时复制
	int b = 10;
    cout << "b = " << b << endl;

	system("pause");
	return 0;
}